ERP DEV.WMS/src/Catalogs/вмс_УслугиОтветственногоХранения/вмс_УслугиОтветственногоХранения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>вмс_УслугиОтветственногоХранения</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>Посуточно</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ФормироватьАвтоматически</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УслугаХранения</name>
    <type>
      <types>CatalogRef.вмс_УслугиОтветственногоХранения</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидДвижения</name>
    <type>
      <types>EnumRef.вмс_ВидыДвиженияУслугОтветственногоХранения</types>
    </type>
  </attributes>
  <attributes>
    <name>АлгоритмРасчетаВес</name>
    <type>
      <types>CatalogRef.вмс_Алгоритмы</types>
    </type>
  </attributes>
  <attributes>
    <name>АлгоритмРасчетаОбъем</name>
    <type>
      <types>CatalogRef.вмс_Алгоритмы</types>
    </type>
  </attributes>
  <attributes>
    <name>МерныйУчет</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
</mdclass:Catalog>

ERP DEV.WMS/src/Enums/вмс_ВидыДвиженияУслугОтветственногоХранения/вмс_ВидыДвиженияУслугОтветственногоХранения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>вмс_ВидыДвиженияУслугОтветственногоХранения</name>
  <enumValues>
    <name>Приход</name>
  </enumValues>
  <enumValues>
    <name>Расход</name>
  </enumValues>
  <enumValues>
    <name>Разовая</name>
  </enumValues>
  <enumValues>
    <name>Хранение</name>
  </enumValues>
</mdclass:Enum>

ERP DEV.WMS/src/Catalogs/вмс_УслугиОтветственногоХранения/Forms/ФормаЭлемента/Module.bsl
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УстановитьДоступностьМерногоУчета();
КонецПроцедуры

&НаКлиенте
Процедура ВидДвиженияПриИзменении(Элемент)
	УстановитьВидимостьУслугиДляХранения();
КонецПроцедуры


&НаКлиенте
Процедура МерныйУчетПриИзменении(Элемент)
	УстановитьДоступностьМерногоУчета();
КонецПроцедуры

&НаКлиенте
Функция УстановитьДоступностьМерногоУчета()
	
	Элементы.ГруппаАлгоритмыДляШтучногоТовара.ТолькоПросмотр = Объект.МерныйУчет = Ложь;
	
КонецФункции

&НаКлиенте
Функция УстановитьВидимостьУслугиДляХранения()
	Элементы.УслугаХранения.Видимость = Объект.ВидДвижения = ПредопределенноеЗначение("Перечисление.вмс_ВидыДвиженияУслугОтветственногоХранения.Приход");	
КонецФункции

// ТУ_Уварова 03.09.2026 ++ 3.2.6
&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	НужнаФормаНоменклатуры = НЕ ЗначениеЗаполнено(Объект.Номенклатура);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	Если НужнаФормаНоменклатуры И ЗначениеЗаполнено(Объект.Номенклатура) Тогда
		
		 ПараметрыОткрытия = Новый Структура("Ключ", Объект.Номенклатура);
		 ОткрытьФорму("Справочник.Номенклатура.Форма.ФормаЭлемента", ПараметрыОткрытия);
	
	КонецЕсли;

КонецПроцедуры 
// ТУ_Уварова 03.09.2026 -- 3.2.6
